/**
 * Created by 战-不败的象征 on 2017/4/8.
 */
var article = {
    '2017-2-28': {
        'title': '吃饭去',
        'summary': '食堂就在旁边，好爽，还记得在苏州实习那边，贼累，吃个饭跑一万米 ',
        'content': '时间过的很快，我从小学二年级到大学二年级，浑浑噩噩的度过了十几个春秋，经历了各种各样的事情。回想起来，有酸有甜，有苦有辣，我想起那天在夕阳下的奔跑，那是我逝去的青春。咳咳~简短截说，从上大学开始就没好好学习过，眨眼两年过去，学校组织我们出去实习一个月，说是实习，其实就是培训(毕竟没工资啊)。我还记得半年前去的那苏州，看完之后顿时觉得是风水宝地啊，我的天，跟淮南比起来天上地下，通常火车站就能体现一个城市的水平了。苏州古典的园林气派风，淮南就是个小土包。当时在苏州报的是html5，从那时开始，我便走向了Web前端之路。',
        'view': 20,
        'comment': [
            ['我欲乘风破浪', '2014-12-12', '，原来站长就是这样走向前端之路的啊！不过看起来站长貌似是个屌丝，嘿嘿嘿'],
            ['又恐琼楼玉宇', '2015-1-12', '吃个饭也要写篇文章，i 服了 you']
        ]
    },
    '2017-2-12': {
        'title': '幻听',
        'summary': '幻听你在我的耳边轻轻诉说，夜色多温柔，你有多爱我',
        'content': '在远方的时候 又想你到泪流 这矫情的措辞结构 经历过的人会懂 那些不堪言的疼痛 也就是我自作自受 你没有装聋 你真没感动 一个人的时候 偷偷看你的微博 你转播的歌好耳熟 我们坐一起听过 当日嫌它的唱法做作 现在听起来竟然很生动 可能是时光让耳朵变得宽容  如今一个人听歌总是会觉得失落 幻听你在我的耳边轻轻诉说 夜色多温柔你有多爱我 如今一个人听歌总是会觉得难过 爱已不在这里我却还没走脱 列表里的歌 随过往流动 ',
        'view': 16,
        'comment': [
            ['幻听', '2017-2-4', '大兄弟，你这歌词从哪搞的？而且好歹放首歌上来啊']
        ]
    },
    '2017-1-30': {
        'title': 'H7N9',
        'summary': '赶脚肚子不舒服，脸庞有点发热，莫非中病毒了',
        'content': '我也是醉了，昨天老妹给我发了个消息，说她们学校因为这个病毒上腾讯新闻了，搞的我都有点慌了，毕竟我还记得前几天一直在吃鸡块面(那鸡肉真的多)，我说肉怎么这么多！！！当时我把隔壁渣比叫上去吃，这比跟我讲肉多是因为H7N9，还说我们这边有个村因为这病毒都封村了，当时我就不信，说了句毛线。现在我是真的有点慌了，咋办啊啊啊啊啊啊',
        'view': 22,
        'comment': [
            ['哎呦', '2017-4-7', '站长有个老妹？介绍介绍？嗯~ o(*￣▽￣*)o'],
            ['都当', '2017-3-4', '求爆照求爆照'],
            ['曾江', '2017-3-1', '最近H7N9真的流行，我浙江那边也出事了，我也有点慌'],
            ['离开家', '2017-2-16', 'H7N9型禽流感是一种新型禽流感，于2013年3月底在上海和安徽两地率先发现。H7N9型禽流感是全球首次发现的新亚型流感病毒，尚未纳入我国法定报告传染病监测报告系统，并且至2013年4月初尚未有疫苗推出。被该病毒感染均在早期出现发热等症状，至2013年4月尚未证实此类病毒是否具有人传染人的特性。']
        ]
    },
    '2017-1-5': {
        'title': '宿舍宽带',
        'summary': '不知道怎么回事，开个门我的宽带就断了，有时候信号一跳一跳的',
        'content': '时光似箭，日月如梭。我们终于搬进了新校区，宿舍的宽带也从2M提高到了12M，虽然说不错，但是我还记起营业厅里那个人多啊，看到的除了头就是脚，毕竟电信和学校搭上了钩，不火都难。然而，新开的嘛，就跟我的站一样，问题多于牛毛，Oh my God!反正我是最后摞着去办的，毕竟宽带还是要用滴，办完后等了个四五天，还是629，于是又跑了趟，高了半天，原来是我把密码记错了，我的天，当时在电话里的时候就好尴尬，不过对面小姐姐还是不错的，甜美地回了句没事，我脸红了。。。话说回来，这网是真的有问题，每次开关门网就断了，某次我撸着撸着掉线了。结果输了一波团战，少了一条大龙，跪了一把游戏，那酸爽，就差没砸键盘了。',
        'view': 50,
        'comment': [
            ['战争学院', '2017-1-12', '哪个区的啊？大兄弟要不要来一区来个双排，带你飞'],
            ['道格特', '2017-2-13', '站长你这是不务正业，要好好学习，天天向上。Good good study, day day up.让我们一起加油']
        ]
    },
    '2017-4-7': {
        'title': '累',
        'summary': '最近几天都在写代码，挺累的',
        'content': '由于昨天晚上把wamp给搞坏了，导致我又得重新装一遍，心累，关键是懵逼了，一脸啥情况。所以心情不好，撸了一把，还买了个剑魔打了把排位上床睡觉，可是翻来覆去睡不着，一直到两三点才入眠，今天呢十一点起床，看着室友都去上课，赶脚自己身上有一种深深的罪恶感，',
        'view': 50,
        'comment': [
            ['而且', '2017-4-7', '哦']
        ]
    }
};
//  存储的数据
var s1 = '<div class="comment-info row"> <div class="col-lg-3 col-md-3 col-sm-3"> <p> <i class="fa fa-user"></i> <span>',
    s2 = '</span> </p> <p> <i class="fa fa-clock-o"></i> <time>',
    s3 = '</time> </p> </div> <div class="col-lg-9 col-md-9 col-sm-9"> <p>',
    s4 = ' </p> </div> </div>';
//  这几个字符串组成评论区


$(document).ready(function () {

    loadBGM();
    //  加载背景音乐
    $('#thank-btn').click(function () {
        $('#thank').collapse();
    });


    var riQi = sessionStorage.getItem('riQi');
    if(riQi){
        initModal(riQi);
        $('#article').modal();
        sessionStorage.removeItem('riQi');
        //  保证只能从首页触发
    }
    //  首页链接到此

    $('.life-item').click(function () {
        initModal($(this).text());
        $('#article').modal();
    });


    function initModal(time) {
        var art = $('#article'),
            col = $('#collapse');
        var artB = $(art).find('.modal-body'),
            spn = $(art).find('.modal-footer').children('span');
        $(art).find('h4').children('span').text(article[time]['title']);
        $(artB).children('p').eq(0).text(article[time]['summary']);
        $(artB).children('p').eq(1).text(article[time]['content']);
        $(spn).eq(0).children('sub').text(time);
        $(spn).eq(1).children('sub').text(article[time]['view']);
        var len = article[time]['comment'].length;
        $('.comment').children('sub').text(len);
        $(col).removeClass('in').children().remove('.comment-info');
        for(var i =0;i<len;i++){
            $(col).append(
                s1 +
                article[time]['comment'][i][0] +
                s2 +
                article[time]['comment'][i][1] +
                s3 +
                article[time]['comment'][i][2] +
                s4
            );
        }
    }
    //  加载模态框信息
});
